<template>
  <div class="rules">
    <section class="hero is-primary is-halfheight">
      <div class="hero-body">
        <div class="content">
          <h1>Game rules</h1>
          <p>
            <strong>«Балда»</strong> — лингвистическая настольная игра для 2 — 4
            игроков, в которой необходимо составлять слова с помощью букв,
            добавляемых на квадратное игровое поле. Слова составляются
            посредством переходов от буквы к букве под прямым углом.
          </p>
          <p>
            Игровое поле представляет собой 25, 36, 49, 64 -клеточную квадратную
            таблицу, ячейки центральной строки которой содержат по одной букве,
            а строка целиком — произвольное 5, 6, 7, 8 -буквенное нарицательное
            имя существительное в именительном падеже и единственном числе.
            Размеры поля, расположение и длина слова могут варьироваться, тем не
            менее количество пустых клеток в начале игры должно делиться на
            количество игроков нацело, чтобы у всех игроков было одинаковое
            количество ходов (слов).
          </p>
          <p>
            Во время своего хода игрок может добавить букву в клетку,
            примыкающую к заполненной клетке таким образом, чтобы получалась
            неразрывная прямоугольная ломаная из клетки с добавленной буквой и
            других заполненных клеток, представляющая собой слово, или
            пропустить ход (если оба игрока трижды подряд пропускают ход, то
            фиксируется ничья).
          </p>
            <h5>В течение игры должны соблюдаться также следующие правила:</h5>
          <p>
            <ol>
            <li>Игроки ходят по очереди.</li>
            <li>Каждая клетка содержит только
            одну букву, каждая буква в составленном слове приносит игроку
            одно очко.</li>
            <li>Слово должно содержаться в словаре, <b>при этом запрещаются:</b></li>
              <ul>
                <li><i>аббревиатуры (FBI, CIA, WYSIWYG)</i></li>
                <li>слова с <i>уменьшительно-ласкательными (банька,
                дочурка, ножик)</i></li>
                <li><i>слова с размерно-оценочными суффиксами (домина, зверюга,
                ножища)</i></li>
              </ul>
            <li>Слова в одной игре повторяться не могут, даже если это омонимы.</li>
            <li>Игра заканчивается тогда, когда либо заполнены все клетки, либо
            невозможно составить очередное слово. Выигрывает тот игрок, который наберёт большее количество
            очков.</li>
            <li>Игра заканчивается ничьей в после троекратного пропуска хода обоими
            игроками.</li>
            <li>В игре используется контроль времени для предотвращения намеренного
            затягивания партии.</li>
            </ol>
          </p>
          <h3>Варианты игровых ситуаций</h3>
          <div class="container has-text-centered">
            <figure class="image is-inline-block is-128x128">
              <h1 class="title is-5">5x5 поле</h1>
              <img src="https://avatars.githubusercontent.com/u/111589147" />
            </figure>
            <figure class="image is-inline-block is-128x128">
              <h1 class="title is-5">5x5 поле</h1>
              <img src="https://avatars.githubusercontent.com/u/111589147" />
            </figure>
            <figure class="image is-inline-block is-128x128">
              <h1 class="title is-5">5x5 поле</h1>
              <img src="https://avatars.githubusercontent.com/u/111589147" />
            </figure>
            <figure class="image is-inline-block is-128x128">
              <h1 class="title is-5">5x5 поле</h1>
              <img src="https://avatars.githubusercontent.com/u/111589147" />
            </figure>
          </div>
        </div>
      </div>
    </section>
    <FooterComp />
  </div>
</template>

<script>
import FooterComp from "@/components/FooterComp.vue";
export default {
  name: "RulesView",
  components: { FooterComp },
};
</script>

<style lang="scss" scoped>
</style>
